lowvisgraflatplate/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.1;

vertices
(
    (0 0 0)
    (1 0 0)
    (1 1 0)
    (0 1 0)
    (0 0 0.1)
    (1 0 0.1)
    (1 1 0.1)
    (0 1 0.1)
    (6 0 0)
    (6 1 0)
    (6 0 0.1)
    (6 1 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 80 1) simpleGrading (0.2 40 1)
    hex (1 8 9 2 5 10 11 6) (100 80 1) simpleGrading (6 40 1)
);

edges
(
);

boundary
(   
    ZeroGradientPlanes
    {
        type patch;
        faces
        (
            (1 5 4 0) //Bottom Wall
	    (8 9 11 10)
            (3 7 6 2) //Top Wall
            (2 6 11 9)
        );
    }
    Inlet
    {
        type patch;
        faces
        (
            (0 4 7 3) //Left Wall
        );
    }
    Plate
    {
        type wall;
        faces
        (
            (1 8 10 5) //Plate
        );
    }
    FrontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1) //Back Wall
            (4 5 6 7) //Front Wall
	    (1 2 9 8)
	    (5 10 11 6)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
